{
  "alpha_pattern": {},
  "base_model_name_or_path": "bigscience/mt0-base",
  "bias": "none",
  "cells_to_save": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "target_cells": [
    "v",
    "q"
  ],
  "task_type": "SEQ_2_SEQ_LM",
  "use_dora": false,
  "use_rslora": false
}